tutorial_cases/OF13/STR_rotatingMesh/0/H2O.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      YH2O.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type           zeroGradient;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      uniform 1;
        value           $internalField;
    }
    wall
    {
        type            zeroGradient;
    }

    #includeEtc "caseDicts/setConstraintTypes"

    nonCouple
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
