tutorial_cases/OF13/STR_rotatingMesh/0/U.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;

        alpha           alpha.gas;

        volumetricFlowRate
        {
            type    scale;

            scale
            {
                type        linearRamp;

                start       1;
                duration    0.1;
            }

            value   0.0005 [m^3/min];
        }

        value                 uniform (0 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.gas;
        value           uniform (0 0 0);
    }

    stirrer
    {
        type            movingWallSlipVelocity;
        value           $internalField;
    }

    shaft
    {
        type            rotatingWallVelocity;
        #include        "$FOAM_CASE/constant/rotatingZoneProperties"
        value           uniform (0 0 0);
    }

    wall
    {
        type            slip;
    }

    #includeEtc "caseDicts/setConstraintTypes"
    
    nonCouple
    {
        type            movingWallSlipVelocity;
        value           $internalField;
    }
}

// ************************************************************************* //
