tutorial_cases/OF13/STR_rotatingMesh/0/k.gas

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInlet          0.001;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $kInlet;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.gas;
        inletValue      uniform $kInlet;
        value           uniform $kInlet;
    }

    wall
    {
        type            kqRWallFunction;
        value           uniform $kInlet;
    }

    #includeEtc "caseDicts/setConstraintTypes"

    nonCouple
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
