tutorial_cases/OF13/STR_rotatingMesh/0/omega.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInlet      1.0;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $omegaInlet;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.gas;
        inletValue      uniform $omegaInlet;
        value           uniform $omegaInlet;
    }

    wall
    {
        type            omegaWallFunction;
        value           uniform $omegaInlet;
    }

    #includeEtc "caseDicts/setConstraintTypes"

    nonCouple
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
