tutorial_cases/OF13/STR_rotatingMesh/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pointSync true;

patches
(
    {

        name sidewalls;

        patchInfo
        {
            type wall;
        }

        constructFrom patches;

        patches (walls walls_coarse);

    }
    {

        name plate;

        patchInfo
        {
            type wall;
        }

        constructFrom patches;

        patches (plate0);

    }
    {

        name tube;

        patchInfo
        {
            type wall;
        }

        constructFrom patches;

        patches (tube0);

    }
);

// ************************************************************************* //
