tutorial_cases/OF13/STR_rotatingMesh/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

zones
{
    gas
    {
        type        box;

        box         (-0.51 -0.51 0.0951) (0.51 0.51 1.5);

        values
        {
            alpha.gas       1;
            alpha.liquid    0;
        }
    }
}

// ************************************************************************* //
